OpenFOAM/WFD_OpenFOAM/cases/batch_20260528_163554_29fba9/baseline_pitch_8p5_chord_0p4_0p6_0p25/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 288.15;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 288.15;
        value           uniform 288.15;
    }

    sideWalls
    {
        type            zeroGradient;
    }

    propeller
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
